; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v13 ?v10)
             (pred_6 ?v3 ?v8)
             (pred_11 ?v13 ?v8)
             (pred_12 ?v11 ?v13 )
	     (pred_7 ?v13)
             (pred_10 ?v9)
             (pred_8 ?v3)
             (pred_5 ?v8)
             (pred_1 ?v13)
             (pred_9 ?v3)
             (pred_4 ?v13)
             (pred_2 ))



(:action op_4
:parameters (?v2 ?v6 ?v1 ?v7)
:precondition (and (pred_10 ?v2) (pred_10 ?v6) (pred_8 ?v1) (pred_5 ?v7)
          (pred_3 ?v2 ?v6) (pred_6 ?v1 ?v7)
                   (pred_11 ?v6 ?v7) (pred_7 ?v2) 
                   (pred_1 ?v6) (pred_9 ?v1))
:effect (and  (pred_4 ?v6) (not (pred_1 ?v6))))


(:action op_3
:parameters (?v2 ?v4)
:precondition (and (pred_10 ?v2) (pred_10 ?v4)
               (pred_7 ?v2) (pred_3 ?v2 ?v4) (pred_4 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v2))))

(:action op_5
:parameters (?v2 ?v1)
:precondition (and (pred_10 ?v2) (pred_8 ?v1) 
                  (pred_7 ?v2) (pred_12 ?v1 ?v2) (pred_2 ))
:effect (and (pred_9 ?v1)
   (not (pred_12 ?v1 ?v2)) (not (pred_2 ))))


(:action op_2
:parameters (?v2 ?v12 ?v5)
:precondition (and (pred_10 ?v2) (pred_8 ?v12) (pred_8 ?v5)
                  (pred_7 ?v2) (pred_9 ?v5) (pred_12 ?v12 ?v2))
:effect (and (pred_9 ?v12) (pred_12 ?v5 ?v2)
        (not (pred_9 ?v5)) (not (pred_12 ?v12 ?v2))))

(:action op_1
:parameters (?v2 ?v1)
:precondition (and (pred_10 ?v2) (pred_8 ?v1) 
                  (pred_7 ?v2) (pred_9 ?v1))
:effect (and (pred_2 ) (pred_12 ?v1 ?v2) (not (pred_9 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_16 obj_10 obj_03 obj_20 obj_06 obj_17 obj_11 obj_02 obj_18 obj_04 obj_12 obj_05 obj_09 obj_08 obj_15 obj_13
    obj_19 obj_07
    obj_01 obj_14
    )

    (:init
       (pred_2)

       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_20)
       (pred_10 obj_06)
       (pred_10 obj_17)
       (pred_10 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_18)
       (pred_10 obj_04)
       (pred_10 obj_12)
       (pred_10 obj_05)
       (pred_10 obj_09)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_13)
       (pred_5 obj_19)
       (pred_5 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_14)

       (pred_3 obj_16 obj_06)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_10 obj_16)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_03 obj_20)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_20 obj_02)
       (pred_3 obj_20 obj_03)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_17)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_17 obj_10)
       (pred_3 obj_17 obj_06)
       (pred_3 obj_11 obj_12)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_02 obj_05)
       (pred_3 obj_02 obj_20)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_18 obj_09)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_12 obj_11)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_05 obj_13)
       (pred_3 obj_05 obj_02)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_13 obj_05)
       (pred_3 obj_13 obj_15)
       (pred_1 obj_17)
       (pred_1 obj_13)
       (pred_11  obj_17 obj_19)
       (pred_11  obj_13 obj_07)
       (pred_4 obj_16)
       (pred_4 obj_10)
       (pred_4 obj_03)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_11)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_04)
       (pred_4 obj_12)
       (pred_4 obj_05)
       (pred_4 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_15)

       (pred_6  obj_01 obj_19)
       (pred_6  obj_14 obj_07)
       (pred_12 obj_01 obj_18)
       (pred_12 obj_14 obj_08)
       (pred_7 obj_16)
    )

    (:goal (and
       (pred_12 obj_01 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_06)))
)
)

; plan
1. (op_3 obj_16 obj_10)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_10)
   goals met: 0 of 1
2. (op_3 obj_10 obj_03)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_03)
   goals met: 0 of 1
3. (op_3 obj_03 obj_11)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_11)
   goals met: 0 of 1
4. (op_3 obj_11 obj_12)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_12)
   goals met: 0 of 1
5. (op_3 obj_12 obj_04)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_04)
   goals met: 0 of 1
6. (op_3 obj_04 obj_18)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_18)
   goals met: 0 of 1
7. (op_5 obj_18 obj_01)
   deleted: (pred_12 obj_01 obj_18) (pred_2)
   added: (pred_9 obj_01)
   goals met: 0 of 1
8. (op_3 obj_18 obj_04)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_04)
   goals met: 0 of 1
9. (op_4 obj_04 obj_17 obj_01 obj_19)
   deleted: (pred_1 obj_17)
   added: (pred_4 obj_17)
   goals met: 0 of 1
10. (op_3 obj_04 obj_17)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_17)
   goals met: 0 of 1
11. (op_3 obj_17 obj_10)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_10)
   goals met: 0 of 1
12. (op_1 obj_10 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_2) (pred_12 obj_01 obj_10)
   goals met: 1 of 1
